schools_choice = [
    "Aqbobek International School", "Aqbobek Lyceum",
    "№1 Орта Мектеп", "№2 Мектеп Гимназия", "№3 Орта Мектеп", "№4 Орта Мектеп", "№5 Орта Мектеп", "№6 МГ",
    "№8 Орта Мектеп", "№9 Орта Мектеп", "№10 Орта Мектеп", "№11 Мектеп Гимназия", "№12 Орта Мектеп", "№13 Орта Мектеп",
    "№14 Орта Мектеп", "№15 Орта Мектеп", "№16 Орта Мектеп", "№17 Мектеп Гимназия", "№18 Орта Мектеп", "№19 Орта Мектеп",
    "№20 ОМЛ", "№21 Мектеп Гимназия//(", "№22 Орта Мектеп", "№23 ОМЛ", "А.Байтұрсынұлы ат. ЛМГ",
    "№25 Орта Мектеп", "№26 Орта Мектеп", "№27 ОМЛ", "№28 Орта Мектеп", "№29 Орта Мектеп", "№30 Орта Мектеп",
    "№31 Орта Мектеп", "№32 Мектеп Гимназия", "№33 Орта Мектеп", "№34 Орта Мектеп", "№35 Орта Мектеп", "№36 Орта Мектеп",
    "№37 Орта Мектеп", "№38 Орта Мектеп", "№39 Орта Мектеп", "№40 Орта Мектеп", "№41 Мектеп Гимназия", "№42 Орта Мектеп",
    "№45 Орта Мектеп", "№46 Орта Мектеп", "№47 Орта Мектеп", "№48 Орта Мектеп", "№49 Орта Мектеп", "№50 Орта Мектеп",
    "№51 Мектеп Гимназия", "№52 НМ", "№53 Орта Мектеп", "№54 НМ", "№55 Орта Мектеп", "№56 Орта Мектеп",
    "№57 Орта Мектеп", "№58 Орта Мектеп", "№59 Орта Мектеп", "Д.Қонаев ат. Мектеп Гимназия", "№61 Орта Мектеп", "№62 Орта Мектеп",
    "№63 Орта Мектеп", "№64 Орта Мектеп", "№65 Орта Мектеп", "№66 Орта Мектеп", "№67 Орта Мектеп", "№68 Орта Мектеп",
    "№69 Орта Мектеп", "№70 Орта Мектеп", "№71 Орта Мектеп", "№72 ITЛ", "№73 Орта Мектеп", "№74 Орта Мектеп",
    "№75 Орта Мектеп", "№76 Орта Мектеп", "№77 Орта Мектеп", "№78 Мектеп Гимназия", 'Назарбаев Зияткерлік Мектебі',
    "Ақтөбе Орта Мектеп", "Белогор Орта Мектеп", "Благодар Орта Мектеп", "Елек Орта Мектеп", "Заречный МБ", "КҚОМ", 
    "Қызылжар Орта Мектеп", "Қ.Сәтбаев ат. ОМЛ", "Пригород Орта Мектеп", "Сазды Орта Мектеп", "Госшколы", "Шанырак",
    "Самғау", "Сымбат", "Білім гимназия", "Білім Ақтөбе", "KAZGUU School.Aqt",
    "Баишев", "Кемел білім", "Smart Bilim", "Басқа"
]

rank_dict = {
    'iron': 'Iron',
    'bronze': 'Bronze',
    'silver': 'Silver',
    'gold': 'Gold',
    'plat': 'Platinum',
    'diamond': 'Diamond',
}

rank_id = {
    'iron': 1,
    'bronze': 6,
    'silver': 11,
    'gold': 16,
    'plat': 21,
}

rank_up = {
    'iron': 'bronze',
    'bronze': 'silver',
    'silver': 'gold',
    'gold': 'plat',
    'plat': 'diamond'
}